{
    "doc": {
      "front": "default",
      "back": "beige"
    },
    "rec_name": "Betsy",
    "messages": {
      "1": {
        "layout_id": 1,
        "name": "Lonnie, Victoria, Alexandra, Kaia and Kingston",
        "msg": "Betsy,\n\nA great neighbor is a wonderful blessing.  Thank you for welcoming us to the neighborhood before we even moved in.  Your holiday party is iconic.  Wishing you all the best today and in the year to come!\n\nHappy Birthday!\nThe Davis Family\nLonnie, Victoria, Alexandra, Kaia and Kingston",
        "img_file": ""
      },
      "2": {
        "layout_id": 1,
        "name": "Andy Lawson",
        "msg": "Betsy,  It's been amazing being friends with you for over 40 years.  Lots of memories from Brown House up to the present.  The ACC tournament road trip was a classic! You're an inspiration for your incredible energy and unwavering positive attitude.  I especially have appreciated your support and advice over the years.  Happy Birthday and lots of love, Andy",
        "img_file": "images/bob/andylawson.jpg"
      },
      "3": {
        "layout_id": 1,
        "name": "Kathy Edmunds",
        "msg": "I first met Betsy over 35 years ago, when she and Hooks made a special trip to New York to meet me, her brother Rick’s new girlfriend. They told lots of very rude and funny stories about Rick, so I was instantly smitten. Betsy has a fabulous sense of humor that has lightened the mood ever since.\n\nWe all lived in the DC area when our children were born, so I leaned on Betsy’s parenting skills from the minute we brought Maggie home. She has always been so calm and assured about dealing with babies and I, who knew nothing, learned literally everything I know about keeping an infant alive from her. It has been such a joy to watch her kids and ours grow up together. \n\nI think one the biggest impacts Betsy has had on my life so far, beyond being such a good friend and family member, was introducing me to Hooks. He was one of my very favorite humans and we had so much fun in our “outlaw” club with Dennis and Cheney and Nancy Page. I am forever grateful that he was my friend. \n\n Happy birthday Betsy!  I love you. \n\nKathy",
        "img_file": "images/bob/kathyedmunds.png"
      },
      "4": {
        "layout_id": 1,
        "name": "Eric Welsh",
        "msg": "Betsy, you are such a dear friend. From the moment I met you at Duke, I saw that you had an incredible spirit and energy. You still have that today. It is such fun to be around you. Happy Birthday! ",
        "img_file": "images/bob/ericwelsh.jpeg"
      },
      "5": {
        "layout_id": 1,
        "name": "Erika Trost",
        "msg": "Happy Birthday to you, Betsy!\n\nI am so grateful that I've gotten to know you on and off the tennis court over the last decade. \n\nOur U of M offspring, shared love of Ontario summers and willingness to play tennis three times in a day make us kindred spirits.\n\nI admire your energy, resilience, adventurous spirit and love for your family. You are a gem, Betsy! \n\nI wish you lots of fun celebrating your birthday and and hope your year ahead will be fab!\n\nI look forward to many more good times with you...\nLove, Erika Trost",
        "img_file": ""
      },
      "6": {
        "layout_id": 1,
        "name": "Sharon Komlofske",
        "msg": "Dear Betsy,\n\nCan you believe that we've been friends since it was OK to wear stripes and polka dots together? And since granny flannel nightgowns were all the rage? I'm so grateful that we've been able to share so many memories. Thank you, Betsy, for being so generous with your friendship and hospitality. I know I disappeared for a while, but you never hesitated to welcome me back into your life. It's a special friendship when you can pick up right where you left off. I hope that we get many more laughs together in the years to come.\nMuch love, \nSharon",
        "img_file": "images/bob/sharon.jpg"
      },
      "7": {
        "layout_id": 1,
        "name": "Laura Simpson",
        "msg": "To Besty, my dear sister-in-law, on this your birthday \nShe cares for so many… kids, friends and family\nA kind word, a gift, a meal prepared hot and ready\nShe give gifts so generously and always a-plenty\nShe’s off in the morning with a diet coke filled tennis ball cup \n\nIn the convertible or the golf cart, tearing it up\nAlways the competitor, tennis is a serious commitment\nWith energy, a springy step and a cute outfit\nCalling out “good shot” for fellow players to cheer them on\nYou can hear her laugh all the way at twenty-one\n\nShe spent many years caring for the four kiddos, the dog, the brood\nNow enjoying some free time, at least until more grands arrive this June\nShe loves being a grandma, “I’m so lucky” she always says\nRunning to Atlanta with every chance that she gets\n\nTo our beloved Hooks, she was a wonderful wife \nWe lost him too soon, it was too short of a life\nTo him, she gave care, love, joy, a marriage original\nHe was so loved by her…. we are so grateful\n\nHer energy is contagious, always on the go\nMaking runs to the store and of course, Costco!\nWe love her so much, she is truly one in few\nShe has the spark, dear Betsy, happy birthday to you!!",
        "img_file": "images/bob/laurasimpson.JPG"
      },
      "8": {
        "layout_id": 1,
        "name": "Laurie Morris",
        "msg": "Betsy, I couldn’t find any photos of us to share with you, but we share this beautiful granddaughter!  Loved these pictures of you spending time with Kate.  Have enjoyed getting to know you over the years, and appreciate all of the love and support you’ve given James and Kate, as well as Mary.  I wish you a wonderful birthday this year ahead, and a year filled with happiness and adventures.  Love to you, Laurie ❤️",
        "img_file": "images/bob/lauriemorris.jpeg"
      },
      "9": {
        "layout_id": 1,
        "name": "Beth Singer",
        "msg": "Betsy has been such a wonderful friend in my life. Smart, reliable, fun, cheerful, cute, charitable, generous are just some of the adjectives that come to mind. Whether its on the tennis court where she is a fierce competitor or sharing a glass of wine afterwards, Betsy is always smiling even when she isn't inside. Betsy is informed on every topic and is happy to share her advice. We raised our kids together driving carpools to tennis practice and carpools to Flint Hill  School. We both jumped into a plane to visit a friend in Florida who was really down. I know we will be 'Friends for life.' ",
        "img_file": ""
      },
      "10": {
        "layout_id": 1,
        "name": "Rick Edmunds",
        "msg": "Betsy. I won’t try to put a bunch of nostalgic or emotional feels here, but suffice it to say that what I treasure most is our family and the love we have for each other. And you in particular - from the early age of trying to combine rooms given how much we loved hanging together to having slightly more frequent time together as NVA residents - mean so much to me. \n\nI wish you and hugely happy birthday and, far more importantly, a tremendously active, exciting, fun-filled year ahead!",
        "img_file": "images/bob/rickedmunds.JPG"
      },
      "11": {
        "layout_id": 1,
        "name": "Susan Johnston",
        "msg": "Here is Betsy in one of our shared happy places, taking part in the 'Kilties parade' in Kindardine, Ontario.  Betsy means the world to me as a daughter-in-law, mother of our four precious grandchildren, an always welcoming aunt to her many nieces and nephews, and as a wise counsel and friend to me. \n\nfrom her daughter-in-law, Susan ",
        "img_file": "images/odwa.jpg"
      },
      "12": {
        "layout_id": 1,
        "name": "Nancy Page Edmunds",
        "msg": "How does a mom describe her near perfect daughter of almost 62 years in a few words and only one picture? A totally impossible task! This is where I desperately need her dear Dad who was an expert at summarizing. He would say his mercurial Betsy was his “bundle of joy.” At that point I might add “and bundle of energy.” But there is so much more. \n\nBetsy, you somewhat summed up what you loved most in life when you chose nursing as your profession. You are a caregiver from your heart! You are happiest when you are doing for others. Just think of the meals you have cooked and delivered to friends and neighbors as soon as you have learned they were sick, hurt or in any kind of distress. And now with your volunteer work as a Stephen Minister you are constantly carrying many “confidential loads” in your heart for others. And you are always available to lend a helping hand at a moment’s notice to anyone in this family\n\nThen there is the fun and adventurous side of your life – traveling, sailing, boating, biking, running, hours on the tennis courts, etc. etc. Remember how miffed you used to be at Dad when he wouldn’t give you tennis lessons until you had “hit on the CCV backboard” how many times?? As a result, look at your cute little figure to this day – as well as advancing to the USTA NATIONAL Championship in Oklahoma!!!\n\nAnd now your newest occupation – Grand-mothering, combining your caregiving and love of fun! What a life.\n\nWhen Hooks was so ill and then sadly left this world, I used to worry so much about you, my precious child, fearing you would never be happy again without your dear Hooks. Yes, your wonderful Dukies kept you busy, and they were always there for you as well as other dear friends and ALL OF YOUR DEAR AND FABULOUS FAMILY. But that loneliness and sadness never left. Then one day I saw happiness begin to creep in to an already busy and full life. I discovered there was someone named Bob who seemed to be taking up a lot of your time and bringing you some newly found joy.\n\nAnd combined with Kate the old “Betsy spark” was returning.\n\nBetsy, I thank you for all the fun, happiness and love you always brought into the lives of your Dad and me. I do believe I am one of the luckiest Moms in the world.\n\n– Nancy Page Edmunds",
        "img_file": "images/bob/nancypage.png"
      }
    }
    }