{
    "doc": {
      "front": "default",
      "back": "beige"
    },
    "rec_name": "Amy",
    "messages": {
      "1": {
        "layout_id": 1,
        "name": "Mimi Rutledge",
        "msg": "Nothing I write could fully describe the love and appreciation I have for Amy. I barely knew her when I signed up for her 2016 cultural immersion trip to South Africa. Little did I know that I would come away with a deeply changed world perspective, but also with a new friendship that has only become more and more important to me over the years. Amy’s kindness, intelligence, empathy, wisdom, patience, humility and integrity are just a small part of what I will always treasure in our friendship. Wishing Amy a truly wonderful next chapter - I can't wait to see what it holds! Love, Mimi",
        "img_file": "images/mimi.jpeg"
      },
      "2": {
        "layout_id": 1,
        "name": "Craig and Michelle Paxton",
        "msg": "When Mike first introduced us to Amy via email in 2008, we had no idea that she would come to play such a huge role in Axium and our lives - but perhaps we should have. For from that very first contact, when she somehow made time in her busy teaching and parenting schedule to help random South African strangers find an apartment in Somerville, her incredible generosity and love for all things South African was on display. Amy and David were among the first to learn of our very nascent plans to launch Axium later that year and then Amy was among the first to visit us in Zithulele when we relocated there two years later. She has since been back countless times, introducing so many of her friends and connections to the beautiful Wild Coast, Axium and many other South African non-profits and people. \n\n Her deep commitment to South Africa went far beyond visits: Ubuntu Global Connections gave substance to her heartfelt desire to do more. It says much both about our own obliviousness to a world outside South African funding, and Amy's long term vision, that it took us several years before we connected the dots between Axium and Ubuntu when Mike and Craig went on their first foray to the US. Feeling well out of our depth, we found such a supportive base in Concord, and in particular at the Gleason's warm home, that it has brought us back again and again. Amy would say that fundraising does not come naturally to her, but she has been instrumental in the success that Axium has had in raising interest and support in the US, without ever veering from her kind, gentle, relational style which continues to draw people to her and to the causes she cares for. We are so grateful for what this success has meant for Axium and the students that we support. \n\nWe are celebrating Amy's retirement from teaching at Middlesex and yet we have barely mentioned the fact that she is a gifted, hugely committed teacher and an immensely caring wife, mother, daughter and friend. Which is perhaps a point in itself. She exemplifies servant leadership in the way she looks outwards, thinks of others first and herself last, and is generous in the extreme. We are so grateful that our paths crossed those many years ago in search of an apartment and that they continue to be so intertwined. We pray that as you move into a new phase in life there would be more time to balance your many interests, and commitments in a way that brings both you and others great joy.  \n\nAll our love and thanks.",
        "img_file": "images/craigmichelle.jpg"
      },
      "3": {
        "layout_id": 1,
        "name": "Joyce DeGreeff",
        "msg": "To Amy - a lifelong educator and dear friend.  Your gifts of warmth, generosity, thoughtfulness, and humor have blessed generations of students, colleagues, and friends.  May the days ahead be filled rest, renewal, joy, and new adventures.  You are loved beyond measure and you’ll always have a home here at MX.\n\nWith deep fondness and respect,\n\nJoyce ",
        "img_file": ""
      },
      "4": {
        "layout_id": 1,
        "name": "Mary Barton",
        "msg": "Amy has been my best friend since I was 3 and she was 2.  We went all the way through school together, and could literally finish each other’s sentences by the end.  After ending up on different sides of the country for college, we traveled through Europe together, and both ended up at different graduate programs at Harvard, of course as housemates.\n\nI thought she might become a math teacher from the age of fifteen.  It was the perfect career for her if only we valued our teachers as we should.  As her friend and cheer leader, it was hard for me to watch her be be underpaid and overworked for thirty years.  She wouldn’t agree, as she clearly wasn’t in it for the money.  But still., she was the best mathematician in our high school and the most interested one in being a great teacher.  To make this career work, she became a dorm mother and a coach or athletic supervisor many times over.  She (and her family) gave up her evenings and her weekends to be a good citizen in the Middlesex community.  My heart kept saying, this isn’t quite right — don’t you guys understand, Amy has degrees from Princeton and Harvard and she could have done anything, but she choose to reinvest in you, because once upon a time, another teacher choose to be invest in her. \n\nOver the years, I learned that it didn’t matter because this is what she wanted and most certainly was born to do.  But ‘m not sure any of us adequately appreciate the daily sacrifices our teachers make.  \n\nThrough the years, we were each others maids of honor, became god parents to each others children, and passed our friendship down to the next generation.  We were supported by awesome spouses and kids as we each made sacrifices for our careers.  I always thought I was adequately compensated, and I always thought Amy should be compensated more. But where would any of us be without teachers willing to accept that reality.  \n\nAfter I decided to retire in 2017, we agreed that we would mark the occasion by riding in the biggest bike race in the world together.  So off we went to South Africa, where she led me up the hills of the Argus with 35,000 other cyclists, and I tried to lead her down. Since then I have been waiting and hoping for her to finally leave Middlesex, reacquire her weekends and a life, and take me on more adventures…Middlesex, I hope you know, you are losing an absolute gem - and it’s high time.",
        "img_file": "images/marybarton.jpeg"
      },
      "5": {
        "layout_id": 1,
        "name": "Alexandra Turner",
        "msg": "Dear Amy,\n\nCongratulations on your retirement from teaching at Middlesex!  Wow, it's hard to believe all these years have passed since we first met at Middlesex.  I know it wasn't 1999 when we first arrived, but it was shortly after that you all returned to campus.  Sometimes it seems like things will always be the same, but then we know and live so many changes everyday.  I'm learning to embrace change, and appreciate the opportunity to learn new things every day. \n\nI feel so fortunate to have had the opportunity to have had you as a colleague at Middlesex, a co-teacher with Youth in Philanthropy, and inspired leader for 100 Women, a mentor in so many ways, and most of all as a friend.  Congratulations on retiring from your work at Middlesex.  You will be missed by many I am sure but not forgotten by the hundreds of students and colleagues you have touched.  You may be retiring from teaching at one place , but I'm sure you are not finished teaching.  I can't wait to see what you do next, and I look forward to learning more from you in the future.",
        "img_file": ""
      },
      "6": {
        "layout_id": 1,
        "name": "Rosie Koontz",
        "msg": "Dear Aunt Amy,\n\nHappy Retirement! Thank you for being such a wonderful aunt!\n\nLove, \n\nRosie",
        "img_file": "images/rosie.png"
      },
      "7": {
        "layout_id": 1,
        "name": "Arden Koontz",
        "msg": "Dear Amy,\n\nCongratulations on your 'retirement'! Retirement in quotes as I know you'll be moving on to many new challenges and opportunities. I know I won't be the only one to say that you've EARNED it. Your service to others, including me, has been amazing to behold all these years. \n\n You are the most awesome sister possible. I've *always* felt safe being open with you about anything on my mind. I treasure our conversations and visits, and during the times in between, it's been a comfort knowing you're always there if I feel like reaching out. \n\nThank you, Boots, and get some rest for a bit!  \n\nLove, \n\nArden\n",
        "img_file": "images/arden.png"
      },
      "8": {
        "layout_id": 1,
        "name": "Teddy Koontz",
        "msg": "Dear Amy,\n\nThank you for a million things. \n\nFor teaching me about kind parenting (with 2 year-old Stevie!) long before I had kids of my own. You made me feel like maybe I can do this too!\n\nFor always prioritizing what’s important-for living from your values and not sweating the small stuff.\n\nFor caring for those less fortunate, and for being a role model - teaching us all to care for marginalized people any way we can - and to find new ways to do it!\n\nFor surrendering and letting go when you need to, and for showing me what that looks like - how that often takes much more strength than holding on and pushing through.\n\nAnd for pushing through! So many examples of when your steady toughness and patient resilience won the day (or year).\n\nFor being a soft place for your brothers to land. I have seen them both be delighted and relieved to be with you. You always have made time for Arden for long honest and heartfelt Sunday chats, and there is no laugh like Paul’s when he makes you smile or you him.\n\nFor making hard choices to honor who you are! In your career, in your life, just about everywhere. You are mighty, Amy.\n\nFor making huge efforts to visit everyone in the family.  I feel so grateful for the energy and resources and precious time you have spent to find us. \n\nFor your children! Danny, with his sweet heart, such a gentle and kind, welcoming and wonderful man. Sarah, whose blue eyes sparkle with fun, who is hard-working and purposeful with an open-mind like her mother. And Stevie, full of adventure and fun and creativity, with wide eyes for the world and an artistic heart. I know they are all beyond blessed to be your children, each bringing parts of  you forward into the world. \n\nAnd for your commitment to wonderful David, and the loving marriage that is itself another role model for so many of us. \n\nThank you for being a teacher in many more ways than just in school!\n\nAnd for being a friend. I love laughing with you and being vulnerable.  \n\nSending you love and hopes for a beautiful retirement, a change of pace, creative opportunities blooming ahead. Could not be more well-deserved!!!\n\nLove \n\nTeddy\n",
        "img_file": ""
      },
      "9": {
        "layout_id": 1,
        "name": "Ron Banay",
        "msg": "For the last several days as I thought of what I would like to say to and about Amy I have found myself with a smile on my face.\n\n Amy and I were colleagues for at least two thirds of the time shewas a classroom teacher. She arrived at Middlesex with a burst of energy which was to become Amy’s modus operandi. Whether it was working her way through the Middlesex mathematics curricula, or exercising her talents in other school areas - corralling a flock of devoted advisees, running a dormitory with care and intelligence, bringing news from grading AP Statistics exams, or her good work with community service - Amy did it all with intelligence and grace. Although Amy worked at several other schools it was Middlesex where she was most at home. \n\nThe foregoing was simply a list of some of Amy’s valuable contributions that we all knew so well at Middlesex. However, for me, Amy was and is a woman of deep kindness and generosity. Her empathy is simply a natural outgrowth of these admirable traits and she is so bursting at the seams with those qualities that she had to find a whole other continent to exercise her abundance of care. In many ways I have always found her miraculously without guile. I suppose the smile on my face arises from the fact that Amy is one of the few people I have known who has remained a true innocent. \n\nBest wishes and thank you. \n\n Ron",
        "img_file": ""
      },
      "10": {
        "layout_id": 1,
        "name": "Azola",
        "msg": "Mama Amy \n\nI just want to thank you for being who you and for listening to what I have to say always being available to chat I really appreciate that and the best memory I have about you is the book you almost read a thousand times me saying again and again I thank you for that I wish you all the best in whatever will bring you joy and yah all the best \n\nFrom Azola\n",
        "img_file": "images/azola.JPG"
      },
      "11": {
        "layout_id": 1,
        "name": "Odwa",
        "msg": "To Mama Amy...\n\nThrough all the years of my life,never could I imagine that God would bless my life and the lives of my Linawo brothers and sisters by sending you in our lives.\n\nYour faithful impact along in my life will for sure remain with me forever because I believe it is God sent. \n\n What I love and appreciate about you is the fact that you played a mother role in my life. You were a shoulder I could lean on and talk to in times of adversity,and your assistance and advice always gave me a kickstart to tackle life and fight back. \n\nI pray and wish you well on your retirement. May it be filled with love,peace,joy,abundance and rest.  \n\n Thanks for being Angel like in my life, happy retirement. \n\n Yours truly: Odwa",
        "img_file": "images/odwa.jpg"
      },
      "12": {
        "layout_id": 1,
        "name": "Heather Lane",
        "msg": "Dearest Amy,\n\nWhat a deep, rich, genuine gift you have been to me!! Middelsex has been richly blessed by your dedication, hardwork, sacrifice, compassion, care, service, expertise and so much more for so many years. It’s hard to believe this season is coming to an end but I know that the fruit of much of your work with remain in the lives of all those students and staff members you have impacted over the years.  I’m SO grateful that I got to meet you on that very first service trip that you came to South Africa with Sara! It’s hard to believe that was in June 2008!! From conquering Table Mountain to both falling in love with a bunch of special kids, it was a fantastic trip!! Then of course there are all the laughs (sometimes only after the event) over misguided navigation, situations created by crossed language barriers or local lingo, vague plans and of course healthy coping strategies, including more coffee. \n\nAmy, I love watching your unassuming but authentic love and care for people spreading around a room like an aromatic boutique of flowers. I love how you sincerely grapple with situations and people who are different to you. But mostly, I’ve loved going deeper with you. Deeper into our shared faith in Jesus. Deeper into friendship. And deeper into sharing experiences across the Atlantic. I’m so grateful to be able to share you with my family. Thank you for your friendship! I love and cherish you deeply. I know that God has more beautiful plans for your life. You are such a willing vessel and I know that you are going to continue to bless others wherever you go. Enjoy this new season and soak up some much deserved rest along the way! \n\n Lots of love\n\nHeather",
        "img_file": "images/heather.JPG"
      },
      "13": {
        "layout_id": 1,
        "name": "Chris Coffin",
        "msg": "Amy,\n\nCongratulations on your retirement from a long and successful career in teaching.  Although I first met you as a teacher at Middlesex, our friendship has gone well beyond the mathematics classroom on the Middlesex School Campus. I have admired the positive impact you have made on so many students over the years,whether it is through your clear mathematical explanations, your calm and nurturing demeanor, or your ability to bring out the best in students.  Our many adventures on the three student trips to South Africa I helped to chaperone will forever be a highlight of my time at Middlesex and were also described as 'life changing' to many of the students lucky enough to go one of your many trips.  You have touched the lives of so many students over the years in and out of the classroom and through your many pilanthropic endeavors - you have had an amazing career.   While we may not be talking about statistics calculus anymore I am quite sure that our adventures together are long from over.  I am selfishly happy that your retirement might allow for us to spend more time together, whether playing Mahjong, kayaking, bowling, or simply taking an afternoon walk together more often.  Welcome to retirement - it's been lonely here without you and I can't wait for our next adventure!",
        "img_file": "images/chriscoffin.JPG"
      },
      "14": {
        "layout_id": 1,
        "name": "Mike Gathercole",
        "msg": "Dearest Amazing Amy,\n\nCongratulations on your upcoming retirement and well done on getting to this point. I know it's been a very tough last stretch but you have not wavered in true Amy fashion! \n\nCan you believe it's been 15 years since we initially met when I was 30 and you were 45. Now I'm 45 and it feels like you're 30! Maybe because I have a 4 month old :)  \n\n Who could have known how my first American group in March 2003 (when working in marketing for Spirit of Africa) would lead me to visiting Indianapolis in 2006 where I met Ambassadors for Children. AFC sent 2 groups to SA through me, a high school group in 2007 and the small group led by Courtney in 2008 which had you, Sara, Andy and Sophie. It feels nostalgic just thinking about it. From that 1st trip, I remember you meeting my parents and having my Dad help with the gardening project at Linawo in Elsies River. The 2009 trip from Middlesex was our 1st trip working together and I would never have imagined then that you would return to SA over 30 times with me organising I'd guess at least 20 or 25 trips, excluding groups you referred to me.\n\n It's been a real blessing to me to have been involved with you over these past 15 years. Meeting your whole extended family either in SA or in the USA has led me to feel like I'm a part of the extended Gleason Koontz family. I've lost track of all the family members and friends of yours I've met over the years who consistently demonstrate a real love and warmth towards you. You might just be the most loved person I know :) My time with you and David in Boston is normally a highlight of the year for me. Just know that I'm wracking up the trips as I feel I've been to Boston at least 10 times now! Words can't describe how grateful I am that you knew my mom and had a special relationship with her. I know she loved her chats with you and it made her really happy. Thank you for the gift of your presence at her funeral in Cape Town in January 2015, I will be forever grateful for that.\n\n Sometimes I joke that your real name is Amazing instead of Amy. It's not hard to make this joke. Just look at how you have cared for and supported the Linawo children since 2008. You have such generosity and kindness and loyalty, it's just a gift to be friends with someone like you. It's not to be taken for granted. So many people have been blessed by you in SA outside of the Linawo gang, whether that's me and my family, Heath, the Paxtons and the extended Axium community, Zithulele Independant School, Nobuntu, Zisipho, Zain, u-turn to name but a few. Makes me think who in SA hasn't been positively impacted by Amy's generosity and care.  \n\nThe endless financial giving is only just one side of your generosity as there is also your time taken on phone calls, whatsapp, emails and general admin. You express such a hugeness of heart it's almost like you're too good to be true. But knowing you for 15 years, I know it is true. I honestly don't know anyone remotely like you who gives so much of her time and energy for the selfless benefit of others. I'm just so grateful that David, Danny, Sara and Stevie have allowed you to be shared so generously with South Africa and for your commitment and sacrifices made to do what you do over such a long period of time. \n\nAs a Christian, we're called to love God and to love others. You demonstrate this so strongly and so beautifully.  I leave you with my favourite verse from Proverbs 3:5&6 to encourage you as you begin a new chapter in your life. I look forward to welcoming you to Berlin one day soon and better yet, I look forward to many many more years together of good times :)\n\n Lots of love, \n\n Mike, Steph, Emma and Lukas \n\nps: the photo is from one of the funniest trips in my life. I don't think I ever laughed so much! We have so many great shared memories of travelling around SA together showcasing the best of SA to visiting Americans. How many Americans had a life changing travel experience through our work together? Too many to recall - definitely a highlight of my life.",
        "img_file": "images/mikegathercole.jpeg"
      },
      "15": {
        "layout_id": 1,
        "name": "Dad",
        "msg": "Dear Amy,\n\nThe opportunity to learn math for so many students has been your invaluable gift to Middlesex. I doubt they had a clue what a treasure they were getting when they made that hire years ago. One student told us that you alone in her schooling could 'make her understand math'.\n\nI hope this had provided some fun and sense of accomplishment along the way for you – surely so! I can tell you it has been fun to watch from afar and I have always felt great pride when I tell people about your career. Thank you for that!\n\nEnjoy your retirement! We send much love,\n\nDad",
        "img_file": "images/grandpa.jpg"
      },
      "16": {
        "layout_id": 1,
        "name": "Suzie Koontz",
        "msg": "Dear Amy, \n\nCongratulations on your retirement! You have had a wonderful career – you have guided your students through the mysteries of math and been “housemother” to so many young girls. You have made a real difference not only in the lives of your students but also in the lives of the children in South Africa that you have helped – and continue to help. \n\n You are a great friend (and a wonderful daughter) – now you will have time to yourself to explore, rest, or just do nothing! Enjoy your freedom – you deserve every minute of it. \n\nWith much love  \n\n Suzie",
        "img_file": "images/suzie.jpg"
      },
      "17": {
        "layout_id": 1,
        "name": "Cordelia Zars",
        "msg": "Dear Amy, \n\nI am so excited for your next chapter in life, and so proud to have been a student of yours during your incredible teaching career. When people ask what I'm most proud of, weirdly I remember the feeling of getting a 5 on my AP Calculus Test, and how remarkable that seemed to me given how horrible I am at math. Of course it was all thanks to you-- the hours of one-on-one coaching, the white board diagrams, the patience with which you approached every question. Outside of the classroom, your nurturing mentorship --almost as a second mother-- quicky became one of the most important relationships of my life. The memories I have of evenings in your living room, the unforgettable trip to South Africa, and volunteering in local soup kitchens and retirement homes define my teenage years. I don't know who I would be without you. You were the first person in my life to ask about my mental health, and to help me understand my relationship with my family. You were the person I felt I could go to for guidance and wisdom as I stumbled along to find my path through life, and I still feel that way today. You and David modeled for me a relationship full of love and support and hope-- which, now that I'm about to get married, I realize I've been trying to emulate since I met you. You came to my recitals when my parents could not; you dropped me off at college; you-- in so many ways-- raised me. I hope that as you look back on your career, you can see it for everything that it was. The education of a generation of students that would never have achieved what they did without you, or even dreamed they could. And beyond that, the way you shaped our lives, forever, with the boundless and unquantifiable measure of your love.  \n\nI know we live far away now, but I still think of you constantly and the impact you've had on my life. This picture of us hangs on my wall right by my desk. I'll never be able to describe how grateful I am for you, or thank you for everything you've done for me. It is truly infinite. \n\n You are an incredible teacher, mother, and friend. I love you so much. Congratulations, and may this next phase of life bring you all the joy and  light you deserve.\n\n Love, \n\n Cordelia",
        "img_file": "images/cordedlia.jpg"
      },
      "18": {
        "layout_id": 1,
        "name": "Helen Weaver",
        "msg": "Amy- \n\nCongratulations on your retirement! You should be proud of your long career as a teacher. I know you have made a difference in the lives of countless teenagers. You are lucky to have had such a clear “calling.” I still remember the day you came back to our Princeton dorm room and announced you had figured out what you were going to do for the rest of your life! We asked you how your final exam went and you answered something like: “Oh I probably failed that – I spent the whole time planning how to get my math teacher certification senior year.”  You told us many stories about your high school math teacher who had been such a great influence on you and how you wanted to be that person for other young students. \n\nI remember visiting you at St. Georges Academy early in your teaching career – when you were only a few years older than some of your students. Then later I visited you in Boston and Concord where your career flourished!  Your stories of your trips to South Africa with your family and your students made me want to go also. I am so grateful to have been able to participate on your first trip specifically for middle-aged women!  It is clear how much you love that place and its people. \n\n I am excited for you as you figure out what comes next for you. Ubuntu Global Connections will be a part of it I am sure. Whatever it is, I wish for you expanded knowledge, joy and fulfillment. \n\n  I am grateful for your presence in my life, \n\nLove, \n\n Helen",
        "img_file": "images/helen.jpeg"
      },
      "19": {
        "layout_id": 1,
        "name": "Julie Kleyn",
        "msg": "Dear Amy \n\nIt’s time! In fact it’s high time! \n\n Middlesex has been so lucky to have you all these years. I can only imagine how positively you have impacted the lives of so many young people. They are very fortunate to have had you in their lives and are the better for it, I know.  \n\nBut now it’s time for AMY!! And we, your friends who love you, are so happy to see you step down from the intensity and stress of teaching, the huge demands on your time and restrictions on your life that this demanding job has required. I know it’s also been super rewarding or you would not have done it for so long, but time’s up! And we are so happy for you and excited to see what your next chapter in life will look like.  \n\nWith much love and huge congratulations on a fantastic job done, \n\nJulie xox",
        "img_file": "images/julieK.jpeg"
      },
      "20": {
        "layout_id": 1,
        "name": "Paul Koontz",
        "msg": "Boots, \n\nWhat a milestone…the end of a career of incredible caring and support for your students, and a well deserved start of something new and fresh. \n\n When I think back to my high school years, I have no trouble remembering those teachers who brought a special mix of dedication, commitment to students along with just the right amount of friendship and humor. I have no doubt you will stand as one of those teachers for the decades of students you’ve taught. They know how lucky they were to have had you.  \n\n Can’t wait to see what lies ahead for you.  Congratulations on a wonderful career doing important and wonderful work. From here, it’s all a bonus. :-) \n\n Love ya, \n\nPaul",
        "img_file": "images/unclepaul.jpeg"
      },
      "21": {
        "layout_id": 3,
        "name": "Dave",
        "msg": "My Dearest Amy! \nCongratulations on your retirement from teaching! 36 years is a long time to have taught – in several different environments – and I am lucky to have been with you for 34 of those years! While your teaching “profession” comes to an end, your teaching “nature” lives on! I am reminded of the following quote which captures the essence of you.\n\n 'You teach by what you say, more by what you do; more still by who you are, and mostly by what you love!' \n\nI am flooded with powerful memories of how your “teaching” has extended way beyond the classroom. Here are just a few … \n\n \t1. Linawo/Ubuntu – On that early trip to South Africa, just before departing Ivy’s Linawo home, you were so moved by the many needs of those children that you made a commitment to yourself – and unknowingly, to all those children – to remain in their lives at least until they were/are 20 years old.\n\n All of that involvement led to more trips with MX students and with many adults – all of whom learned about “what you say, do, love and who you are!” – We have all learned from you! \n\n  \t2. Cor Unum – For your birthday celebration one year, you requested that we (Danny, Sara, Stevie and I ) join you in volunteering to serve the many hungry “guests” of that area of Lawrence.\n\n\t3. West Concord Union Church – In a variety of roles (committee member, bells choir, faithful congregation member), you served that community and paid close and loving attention to the many disabled community members.\n\n\t 4. Axium – You have played a central role – THE central role – in introducing Axium Education to so many people such that many have not only learned from you, but have donated thousands of dollars in support of Axium’s mission … thanks to you!\n\nAs I think back over these and many other experiences, I have always felt so proud of you and lucky to be with you.\n\nI’ve been proud of the many graceful ways you have interacted with your students and coworkers, many of whom have become close friends through the years. With so many people, you have shared your natural warmth, your keen mind and your deeply caring soul … all manifest in your abundant patience and kindness.\n\nI’ve been proud of your never-ending and deeply felt commitment to serving others – as a teacher, spouse, mother, sibling and friend! You are a true “servant leader,” one who can’t help but think of others. It’s not just what you do in your various roles, it’s who you are! Your commitment to serviceand your natural kindness are intertwined with each other, resulting in a contagious sense of love that you share with all you meet.\n\nToots, as you wind down your teaching profession, know that you have been loved and appreciated by so many students and colleagues alike – at St. George’s, Middlesex, St. Paul’s, Ellis, Concord Academy and Dana Hall … as well as at Minuteman Tech, Andover Summer Program and Wediko’s “Think City! As a teacher, you have worked with a wide variety of students for many years. You have invested so much of yourself to the great benefit of so many. I am so proud of you and delighted for you that you have reached this important milestone in your career and life. I look forward to our next chapter together.\n\n Mostly, I look forward to living, loving and learning with you!\n\nI love you very much!\n\nDave",
        "img_file": "images/dad.jpeg"
      },
      "22": {
        "layout_id": 1,
        "name": "Laura Leedy",
        "msg": "Wow this is hard because I just don’t have the words to convey how much Amy and my lifelong relationship with her means to me. Everyone who knows me well knows how important Amy is to me. Technically we are cousins, also classmates and neighbors, but in my heart we are sisters - we have shared a lifetime of memories and I just simply love her as much as I have loved anyone. I’m sure lots of people will write about her compassion, her humanity, her generosity, her intelligence, her insight, her unflappability, her honesty, her fortitude, her beauty.  And deservedly so. But can I just also add that literally no one in the world can make me laugh - actually snort out loud- like Amy can? When I think of her, which is often, I always smile - even in the toughest of times - and maybe also the most inappropriate of times - we can laugh out loud together.  If everyone in the world could just be a teeny tiny little bit more like Amy, not only would the world be a far, far better place, but also a much, much funnier one! Xoxo Laura",
        "img_file": "images/laura.JPG"
      },
      "23": {
        "layout_id": 1,
        "name": "Kelly Marchand",
        "msg": "There are so many memories I share with you, Amy. I have loved being your colleague - loved traveling to Exeter and  North Carolina and that weird modeling conference in NY. I value your expertise in mathematical content. Above all, you have inspired me to play closer attention to my students. Any student or advisee or dorm resident who has worked with you has come away feeling noticed and supported. \n\nTraveling to South Africa with you was life-changing. I got to experience your unique style of leadership, where nothing appears to perturb you -- not the neediness of individuals, not an excess of luggage, not even driving through fire and water!  \n\nYour ability to get things done under pressure, like when you needed a page for an exam that was in progress, is legendary.  \n\nI've learned a lot from you, as have all the students lucky enough to call you their teacher. The teaching road is ending, but hopefully we'll continue along life's path as friends forever.\n\nLove you always, \n\nKelly",
        "img_file": "images/kellym.png"
      },
      "24": {
        "layout_id": 1,
        "name": "Carmen Beaton",
        "msg": "Amy Gleason is honestly one of the most generous, thoughtful and kind people that I have ever met - and that is not an exaggeration.  As a colleague I was always impressed by Amy’s huge heart. Of course, she cared about her students learning math, but she cared just as much about their well-being. It is no surprise that she was so loved by her students, the residents of the dorms that she ran and her advisees.\n\nI am very grateful to Amy for being so generous with me as well.  When I was the dean of students at Middlesex, it is fair to say that the part of my job that I liked the least was rooming.  It was an enormous puzzle, and I worried endlessly about getting the right mix of students in each dormitory, about having students feel pleased or at least comfortable with their placement. Amy regularly volunteered her time, during her precious summer vacation, to come and help me figure it out.  I do not think that I was ever able to express to her how much that help meant to me over the years. Amy is a great puzzle solver, but more than that, she is a great friend willing to give of her time to make my life easier. \n\nAnd I will never forget when Jim and I retired and we were packing up to move from Middlesex to our home in Rockport, Amy would just show up and help us go through kitchen cabinets, closets, etc. and fill boxes.  She helped me make decisions and pack things safely for the move. (After watching me misplace scissors, packing tape or markers several times as we packed, Amy put all the necessary materials in a basket where they could always be found.  Why had I never thought of that? I use that trick to this day when wrapping Christmas presents - and think of Amy every time.) Then she would make trips to Goodwill with things we did not want. I might still be on Oates Lane sitting in the midst of the mess were it not for Amy and, once again, her generosity.\n\nAmy truly is an extraordinary human being who makes life better for others because of her presence in it.  When I count my many blessings, Amy is high on the list.\n\nIt makes me sad to think of Amy leaving teaching - it always makes me sad to see gifted educators leave the classroom, but I have no doubt that whatever Amy chooses to do next, she will continue to make the world a better place. \n\nI wish you all the best, Amy. May you enjoy these upcoming years with Dave and your wonderful children. You deserve all good things! I hope that you will have more free time so that we can see each other more often. \n\n I love you!\n\nXXXOOO, \n\nCarmen",
        "img_file": ""
      },
      "25": {
        "layout_id": 1,
        "name": "Karen Galloway",
        "msg": "Dear Amy\nYou are a blessing to me and to my family too. Thank you for the way you invest intentionally in the kids' lives, for knowing about our lives and challenges. You know all this because you make such a effort not only to visit (all the wierd and wonderful and exciting places at which we end up living), but also to keep in touch in a real and meaningful way. My life is richer for knowing you and learning from you. Thank you for your sincerity, kindness, gentleness, braveness, willingness to be challenged and to keep learning, vulnerability and openness, and noteworthy honesty. May the road rise up to meet you (as you walk the narrow road). May the wind be always at your back (unless you want your hair to blow the other way). May the sun that God made shine warm upon your face; the rains fall soft upon your fields (or at least the flower garden where daffodil and mango grow) and until we meet again, may God hold you in the palm of His hand (cos He promises 'never to leave nor forsake you'). Lots of love, Karen",
        "img_file": "images/karen.jpg"
      },
      "27": {
        "layout_id": 1,
        "name": "Peter Galloway (age 10)",
        "msg": "Hi Amy, you are a very good friend to have when you come and stay with us. We always want you to stay with us for longer than you do. It was really fun cooking with you and your friend Anna too. We are glad we met you. From Peter",
        "img_file": "images/petegalloway.jpg"
      },
      "28": {
        "layout_id": 1,
        "name": "Connor Galloway (age 8)",
        "msg": "Hi Amy. I think you are fun and kind and helpful, I like crocheting with you. Looking forward to seeing you again, from Connor",
        "img_file": "images/connorgalloway.jpg"
      },
      "29": {
        "layout_id": 1,
        "name": "Tessa Galloway (age 11)",
        "msg": "Dear Amy, you are generous, kind and friendly, and it has always been very exciting when you have come to visit us at our home, wherever it was.  I am glad that God made you the way He did. You always made the effort to visit us when we moved all over the place, I am glad that you made the effort to come around my birthday, thank you. Hugs and love from Tess",
        "img_file": "images/tessgalloway.jpg"
      },
      "30": {
        "layout_id": 1,
        "name": "Nancy Herter",
        "msg": "What can I say about Amy? I love everything about her! She is warm, caring, generous, brilliant and hilarious!!\n\nI was lucky to be able to join her on a trip to South Africa in 2016, where she shared with us her passion for helping others. \n\n Amy, Kelly, Chris and I have formed a tight bond over MahJongg and that bond has spilled over to other adventures which I cherish. Whenever we are together, we laugh and laugh and laugh, which as everyone knows, it's the best medicine! \n\n I love you Amy and wish you all the best in retirement.  \n\nLove, Nancy❤️",
        "img_file": "images/nancyh.jpg"
      },
      "31": {
        "layout_id": 1,
        "name": "Roger Galloway",
        "msg": "Dear Amy\n\n\n It has been a privilege to get to know you over the past 8 years.\nYour humble and honest pursuit of the truth is an inspiration to us all.\nIt is really appreciated how you have generously invested so much time and energy into our family over the years.\nEverything from reading to the kids in cyberspace, to being a mule for an assortment of random items like; pig nipple drinkers and dungarees.\nYou intentionality and loyal selflessness to so many is a testament to your character (the folks in Tsolo, Alu, Bathandwa, Bethel, etc)\nWe look forward to your regular visits, as you make the effort to connect with us, no matter how remote the location. \n\nKeep on keeping on \n\nYour friend Roger",
        "img_file": "images/roger.jpg"
      },
      "32": {
        "layout_id": 1,
        "name": "Bathandwa Sigudu",
        "msg": "Dear Amy\n\nYour hard work, determination, and passion for education can never go unnoticed. You have been more than a friend you have been a mother to me, mentoring, naturing, and guiding me through life I sincerely appreciate you. Thank you for 30 years of molding professionals with your bare hands, imparting knowledge and a love for learning to different students of different backgrounds. This must have required a lot of patience and I commend you for all that patience. I want to congratulate you on all of your achievements thus far, I must say that your assistance was really helpful to me, when I started tutoring, I have some knowledge gaps, but I thank you for being that present help and availing yourself to help me in times of need. I know it has been a journey but through it all, I believe that the Lord has been with you. I pray that the Lord may continue to shine His countenance before you. May you enjoy the next milestone of your life and may it be nothing short of the goodness of God. \n\nThank you for investing your time in me and sharing the knowledge that you have with me, it was not in vain, I gained a lot from you. This cannot be a goodbye as I look forward to us communicating, and I look forward to learning more from you. My family and I appreciate you we are very happy and proud of you. You have been there with me since day 1 along with Galloways, thank you so much.  \n\nWarm regards \nBathandwa Sigudu",
        "img_file": "images/bathwanda.jpg"
      },
      "33": {
        "layout_id": 1,
        "name": "Borgie Yunis",
        "msg": "AMY\n\nIt was in the mid 90’s when I first met Amy probably at a parent-teachers conference. Although I don’t remember the meeting my early memory of her was via my son Chris who himself is now a math teacher in a private school. She is the one teacher I remember him speaking about; always with respect and admiration.\n\nFast forward, some years ago Amy joined the church where we attend so we reconnected on a very casual basis. One Sunday our Pastor invited us to participate in a community building exercise and suggested we pick someone to get to know better. I have no idea why Amy picked me but it was indeed a gift. Her openness, warmth and humility were impressive and compelling. The years between us fell away and we soon were finding times to have a few moments (hours?) to visit over a coffee or glass of wine. \n\nAmy indeed is an amazing women. The things she has done for others help define her as does the fact that at least I only learned about them from others. I am proud to be considered her friend!  \n\nFondly, Borgie Yunis",
        "img_file": ""
      },
      "35": {
        "layout_id": 1,
        "name": "Tami Anton",
        "msg": "Dearest Boots,\n\nCongratulations!  What a journey it has been….with many more adventures still to come!  I look forward to long walks in the woods and movie nights as you enter this next phase of your life.  Love you, Tami",
        "img_file": "images/tami.jpeg"
      },
      "36": {
        "layout_id": 1,
        "name": "Anne Martinez",
        "msg": "My Dearest Amy,\n\nFrom meeting you at Princeton in 1980 to our amazing trip to South Africa in 2016 I have cherished our friendship.  Although I haven’t seen you often in the years in between, I always feel like we pick up where we last left off.  I appreciate you so much for your warmth, your values, your kindness, and your wonderful sense of humor.  Your work with Ubuntu is admirable and I am glad I was able to see you in action when you led our group of “Old Ducks” to SA.  Congratulations on your retirement from teaching after 30 years of dedication to your students.  Best wishes to you and your family as you explore the next chapter of your life!\n\nLove always,\n\nAnne (and Larry too)!",
        "img_file": ""
      },
      "38": {
        "layout_id": 1,
        "name": "Sara",
        "msg": "Mom,\n\nCongratulations on your retirement! It’s difficult for me to express how much I love and appreciate you, but I’m going to try :) Just thinking about it makes me tear up! \n\nSometimes I’m in complete awe of you, mostly when I think about the immeasurable impact you’ve had on the lives of so many people through the relationships you’ve sustained in South Africa and connections you’ve helped forge through Ubuntu. Seeing how you’ve spent so much of your energy, time, and money to support people on a personal level moves me, and the ways you’ve helped redistribute money on a large scale from some of the most well-resourced communities to communities of real need is so so inspiring–through Ubuntu and 100 Women and your initiatives at community service director at MX. Especially knowing and relating so much to your discomfort with being in positions of leadership AND knowing how busy your life/work was already without these things, it’s just so amazing to me all that you’ve spearheaded. Your deep care and compassion for others is so apparent in how you live your life, and I feel unfathomably lucky and grateful to be so close a witness to and receiver of this care for my whole life. You've taught me by example over and over how to have and show compassion for others, and I see it as a gift that extends out forever (everything matters!). Especially these past few years as I’ve spent much more time with babies and parents, I’ve felt gratitude in such a deep way for you and dad and ALL you’ve done for me. It’s bigger than I know how to express, but I’m just mind-blown sometimes that I got you as my parents. \n\nIt’s felt really special to have this overlapping year with you at Middlesex. It also feels special to me that I’m here now at the same age that you were when you had me as a baby on this campus. I’ll really miss having you here with me, but I’m really looking forward to spending more time with you in your relaxing retirement days. I’m so excited for you that you will have more time and energy to devote to yourself!! I love you so much, and I’m so proud to have you as my mom. \n\n\nLove, \n\nSara",
        "img_file": "images/sara.JPG"
      },
      "39": {
        "layout_id": 3,
        "name": "Meg McLaughlin",
        "msg": "In conventional ways, Amy and I have been 'work friends' for the last decade or so but, as anyone who knows anything about where we work, there is nothing conventional about being at Middlesex.  Because of the peculiar set of conditions within which we operate here at Middlesex,  work = life, life = work.  Therefore, while I only really see Amy at work, she is really more of a life friend and now, especially, I hope a lifetime friend.  \n\nAmy and I first started cultivating a friendship after her first trip to South Africa.  I remember her returning with her heart ablaze with love for the country and its people.  Because I had worked in an international setting before Middlesex where people had also been marginalized by the international community, we had a lot of connections to that work to share. Further along our journey came an interest in and passion for mindfulness meditation and the ways that we could be supportive of the, then, newly developing program and its infiltration into more parts of the School.  We then got more professional opportunities to work together when Amy was working in the Dean's office.  Professional alignments and collaborations turned into personal connections and a deepening of the 'life friendship' that exists today.  I have been so grateful to remain connected to Amy even after she left Middlesex and saw her as much during that time as I do now since she has returned.  \n\nI love being around Amy because she is consistently authentic Amy every single time.  As a result I bring my authentic self to those encounters and I feel light, easy, and joyful.  And while I'd like to think that this is because of our special connection, I suspect that anyone that has spent time with Amy feels the same way.  \n\nI will be among many who will miss Amy's presence and contributions at Middlesex School.  But I am excited to see what this next part of Amy's adventure brings and I am also hopeful that our enduring friendship will continue and thrive enlivened by Amy's pursuits.  \n\nAmy---with sincere gratitude for the gift of you, \n\nMeg",
        "img_file": ""
      },
      "40": {
        "layout_id": 1,
        "name": "Andy Koontz",
        "msg": "Amy,\n\nCongratulations on your retirement from a long career of teaching!  I’m forever impressed with your ability to juggle a very busy job with raising a family and active volunteering, especially with founding and running Ubuntu. \n\nThe wonderful memories of the last 35+ years are so numerous - summer trips including many at Kirkwood; Thanksgivings, especially at Balclutha; the BVIs; KC and NY; piano duets (many more of those to come I hope) and salty. What’s wonderful about these experiences is spending time with you and your family. You bring a wonderful sense of humor, warmth, and ability to roll with things that I have always appreciated. Not having a sister, I feel like you have been that for me for all of these years. And besides, we share the same enneagram and Meyers Briggs personality type so clearly it was meant to be! \n\nLots of love and looking forward to many more good times together, and congratulations once again on an amazing career in teaching!\n\nLove,  \n\nAndy",
        "img_file": "images/andykoontz.jpeg"
      },
      "41": {
        "layout_id": 1,
        "name": "Mary Hynde",
        "msg": "Dear Amy,\n\n\tCongratulations!  I’m so excited you’re retiring and hope it holds all you want! Now you can throw that into some fun endeavors.\n\nYou’ve had a good run teaching and caring for young people. When you talk about your work it’s easy to hear your passion. You have always been a caring nurturing person and have positively affected many young minds.\n\nI hope we will see more of you in the Midwest now you will have more free time!\n\n\nLove,\n\nMary",
        "img_file": ""
      },
      "42": {
        "layout_id": 2,
        "name": "Ali Rice",
        "msg": "What do you love or appreciate about Amy?\nAmy has such a gentle and kind soul. She cares so much about the people around her, and is able to express that care in authentic and meaningful ways. Whenever I see Amy I always feel like she genuinely wants to know how I've been doing and listens with an open ear and generous heart. Amy is the type of person I want to be 'when I grow up' - even though I am almost 30 :)\n\nShare a favorite and/or meaningful memory you have of/with Amy  \n I had so much fun helping to plan Amy & Sara's birthday party this year and celebrating them! Getting to see so many people coming together to share their joy and love for Amy & Sara was so special!\n\nWhat is a wish or hope you have for Amy?\n\nMy wish for Amy is that she may enjoy her next steps in life, whatever they may be! That she can receive the type of love and care that she offers. And that she can have rest and rejuvenation. That all she has given to others will return to her tenfold. ",
        "img_file": ""
      },
      "43": {
        "layout_id": 1,
        "name": "Mary-Wren vanderWilden",
        "msg": "Amy,\n\tYou truly embody love!  We all get to bask in your sunshine.  Although we have so many wonderful memories in South Africa, I’m including this picture of us in Paris on our layover.  I still laugh thinking about mixing up your bag, walking through the streets of Paris on NO sleep and taking this wonderful boat trip down the Seine while nudging each other not to fall asleep.  I love how nothing flusters you, your incredible sense of humor and just all the love you give to those around you.  I wish you a wonderful retirement and a fun second act.\n\nLove,\nMary-Wren",
        "img_file": "images/maryren.jpeg"
      },
      "44": {
        "layout_id": 1,
        "name": "Phini",
        "msg": "Hi Amy.\nHope you well\nGood lucky for your Retirement\nKeep doing all the good thing as you do \n God bless you, \nPhini",
        "img_file": ""
      },
      "45": {
        "layout_id": 2,
        "name": "George Stewart",
        "msg": "I’ve known Amy (and David) since coming to Middlesex school in 1999–she might have shown up a year or two after, but she had already worked there once.  Amy is the best. No matter how much work she might have she always has a few more minutes for you.\n\nIn more recent years Alexandra and I enjoyed going to the Deep Pour w both David and Amy. In our perfect world, we retire together living next to each other. If I could have a sister, I’d choose Amy—that’d be tough though given we’re exactly the same age and our birthdays are nearly on the same day! She’d have to be my twin! Abrazotes, George ",
        "img_file": ""
      },
      "46": {
        "layout_id": 1,
        "name": "Meg Sullivan",
        "msg": "Dear Amy,\n\nAs you prepare to retire from your successful career, I want to take a moment to express my gratitude and love for you. From my earliest memories, you have always been there, offering a listening ear, a comforting hug, and words of encouragement. Throughout childhood, you and Dave were like a second set of parents to me, Court, and Matt (and Danny, Sara, and Stevie were like another set of siblings). Some of my happiest times were spent at our Doyle-Gleason sleepovers, cookouts and trips. \n\nYour dedication to community service and social responsibility has always been a source of inspiration for me. I have no doubts that you’ll continue to do make major impacts, through your support of Ubuntu as well as other causes you are involved with. Your commitment doesn’t go unnoticed and it motivates others every day.\n\nI hope that in your retirement, you are able to enjoy all your favorite things…relaxation, time with family and friends, and hopefully some great opportunities to travel. I’m excited to see what this next chapter brings for you. Congratulations! I love you! \n\nMeg",
        "img_file": ""
      },
      "47": {
        "layout_id": 1,
        "name": "Mama Noks",
        "msg": "Oh my dear friend, how time just passes by so quickly. It has been a great honor of becoming family with you and the kids.  Although we may be many miles apart i truly appreciate how we have kept the friendship and tell each other stories and how our kids are. From coming to South Africa over 10 years ago and exploring the way we live life and just fitting in so perfectly has been amazing  \n\nAs you retire, please see it as a blessing because you have impacted so many lives and the little seeds will forever bear fruit. I love you very much and see you soon.\n\nLove Mama Noks",
        "img_file": ""
      },
      "48": {
        "layout_id": 1,
        "name": "Stevie",
        "msg": "Congratulations, Mom,\n\nHappy “Retirement” - whatever that means…\n\nThere’s a note you wrote me on one of the darker days at Heard this winter, and I keep it on my bedside table, which is saying something because I don’t love clutter. Whenever it crosses my eye, I am reminded of your warm, encouraging presence, and I feel a wave of support. It’s a gift that keeps on giving. Thank you. \n\nThe note is one of the small ways I’ve felt supported by you in the past 2 years, despite the distance. From the move to LA, the changing jobs, the breakup, and everything in between, you’ve helped me process every challenge that’s emerged and grow from each one. I am so grateful for your continuous love and guidance and don’t know who I’d be without it. I am proud of who I am today and I owe so much of that to you. I guess I hit the jackpot in the mom department. \n\nWhile I may have a heavier dose of support than other students, I know so many students and people have felt similarly supported by you. I know Ben and Jon Luke did at Middlesex when they had you in class, and I know they are not alone. I was always proud to have people know me as your son - I think I got brownie points because of it. We are all so lucky to have you.\n\nI hope this new chapter gives you time and space to invest in yourself, as you have invested in so many others - you deserve it.\n\nLove,\n\nStevie",
        "img_file": ""
      },
        "49": {
        "layout_id": 1,
        "name": "Eliza",
        "msg": "Amy,\n\nCongratulations on your retirement! 30 years of your life dedicated to education is quite an accomplishment. I know you have impacted many people through your work, and also through your volunteer and personal endeavors.\n\nMy wish for you is that you have happiness and excitement entering your next chapter. I look forward to the times we have together ahead of us. Love you!\n\n-Eliza ",
        "img_file": ""
      },
      "50": {
      "layout_id": 1,
      "name": "Danny",
      "msg": "Dear Mom,\n\nHappy retirement!\n\nI hope this new chapter brings excitement, novelty and relaxation for you, Mom. I admire you career in teaching for its longevity! I think that is rare now-a-days and is something to be cherished and celebrated. Cheers to you!\n\nWanted to also say how meaningful it’s been for me to help bring this book together for you. So many of your friends and family have such positive things to say – though I am not surprised, as your son, it’s very meaningful to me to read. \n\nI love you so much! Through our hard times and great times you’ve been there, a true rock. \n\nAll the best to you and your future pursuits. Woo!!! \n\nLove you tons,\nDanny",
      "img_file": "images/danny.jpeg"
    }
    }
  }