[
    {
        "quote": "My humanity is bound up in yours, for we can only be human together.",
        "author": "Archbishop Desmond Tutu"
    },
    {
        "quote": "We are each made for goodness, love, and compassion. Our lives are transformed as much as the world is when we live with these truths.",
        "author": "Archbishop Desmond Tutu"
    },
    {
        "quote": "A leader. . .is like a shepherd. He stays behind the flock, letting the most nimble go out ahead, whereupon the others follow, not realizing that all along they are being directed from behind.",
        "author": "Nelson Mandela, Long Walk to Freedom"
    },
    {
        "quote": "As I have said, the first thing is to be honest with yourself. You can never have an impact on society if you have not changed yourself... Great peacemakers are all people of integrity, of honesty, but humility.",
        "author": "Nelson Mandela"
    },
    {
        "quote": "If you see someone who has good light, thank them for it. It will help them keep the light on.",
        "author": "Jaiya John"
    },
    {
        "quote": "Yes, hurt people might hurt others. But fortunately, free people free others. Safe people shelter others. Enlightened people illuminate others. And love always wins",
        "author": "Vex King"
    },
    {
        "quote": "Wherever one person takes another into the care of their heart, they have the power to bless.",
        "author": "John O'Donohue"
    },
    {
        "quote": "To laugh often and much; to win the respect of intelligent people and the affection of children; to earn the appreciation of honest critics and to endure the betrayal of false friends. To appreciate beauty; to find the best in others; to leave the world a bit better whether by a healthy child, a garden patch, or a redeemed social condition; to know that even one life has breathed easier because you have lived. This is to have succeeded.",
        "author": "Ralph Waldo Emerson"
    },
    {
        "quote": "The creation of a thousand forests is in one acorn",
        "author": "Ralph Waldo Emerson"
    },
    {
        "quote": "In your light I learn how to love. In your beauty, how to make poems. You dance inside my chest where no-one sees you, but sometimes I do, and that sight becomes this art.",
        "author": "Rumi"
    },
    {
        "quote": "The best and most beautiful things in the world cannot be seen or even touched— they must be felt with the heart",
        "author": "Helen Keller"
    }
]
